# Nominal / One hot encoding

In [1]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [2]:
## Create a Dataframe
df = pd.DataFrame({
    'color':['red', 'blue', 'green', 'green', 'red', 'blue']
})

In [3]:
# Create an isntance of OneHot encoder
encoder = OneHotEncoder()

In [4]:
## Perform Fit and Transform
encoded = encoder.fit_transform(df[['color']]).toarray() # Alphabatic Order

In [5]:
import pandas as pd
encoder_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out())

In [6]:
encoder_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [7]:
#When get new data
encoder.transform([['blue']]).toarray()

c:\Users\Owner\Documents\LEVEL 1\Resume\Data Analytics\python\venv\Lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but OneHotEncoder was fitted with feature names
  warnings.warn(

array([[1., 0., 0.]])

In [8]:
pd.concat([df,encoder_df], axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4    red         0.0          0.0        1.0
5   blue         1.0          0.0        0.0

In [ ]:
%pip install seaborn

Requirement already satisfied: seaborn in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: pandas>=1.2 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from seaborn) (3.10.7)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.60.1)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.9)
Requirement already satisfied: packaging>=20.0 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Requirement already satisfied: pillow>=8 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (12.0.0)
Requirement already satisfied: pyparsing>=3 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.5)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\owner\documents\level 1\resume\data analytics\python\venv\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [11]:
import seaborn as sns

In [12]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

Label Encoding

In [13]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [16]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder = LabelEncoder()

In [17]:
lbl_encoder.fit_transform(df[['color']])

c:\Users\Owner\Documents\LEVEL 1\Resume\Data Analytics\python\venv\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [ ]:
## Here when we assigning unique label to different colors the model consider as 2>1>0. But we do not want to give rank to nominal values.

# Ordinal Encoding

In [ ]:
# # THis is Rakable
# # For Example :
# High School - 1
# College - 2
# Graduate - 3
# Post-Graduate - 4

In [27]:
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder

In [28]:
df = pd.DataFrame({
    'size':['small','medium','large','medium','large','small']
})

In [29]:
df

     size
0   small
1  medium
2   large
3  medium
4   large
5   small

In [ ]:
encoder = OrdinalEncoder(categories=[['small','medium','large']]) ## Ordinal Encoder has parameter called Category to give rank.
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.]])

In [33]:
encoder.transform([['small']])

c:\Users\Owner\Documents\LEVEL 1\Resume\Data Analytics\python\venv\Lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

Target Guided Ordinal Encoding

In [35]:
df = pd.DataFrame({
    'city':['Mumbai','Surat','Vadodara','Surat','Vadodara','Mumbai'],
    'price':[200,150,100,180,150,220]
})
df

       city  price
0    Mumbai    200
1     Surat    150
2  Vadodara    100
3     Surat    180
4  Vadodara    150
5    Mumbai    220

In [38]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [39]:
mean_price

{'Mumbai': 210.0, 'Surat': 165.0, 'Vadodara': 125.0}

In [40]:
df['city_encoded']=df['city'].map(mean_price)

In [41]:
df

       city  price  city_encoded
0    Mumbai    200         210.0
1     Surat    150         165.0
2  Vadodara    100         125.0
3     Surat    180         165.0
4  Vadodara    150         125.0
5    Mumbai    220         210.0

In [42]:
df[['price','city_encoded']]

   price  city_encoded
0    200         210.0
1    150         165.0
2    100         125.0
3    180         165.0
4    150         125.0
5    220         210.0